jarodfougere/stm32f4_dockerbuild/Sources/Device/Drivers/Rimot Drivers/stm32f411xe/Peripherals/Src/rimot_usb.c
/**
 * @file rimot_usb.c
 * @author Carl Mattatall (carl.mattatall@rimot.io)
 * @brief This source module provides a low level driver for the usb otg
 * peripheral on the stm32f411re microcontroller
 * @version 0.1
 * @date 2020-04-02
 *
 * @copyright Copyright (c) 2020 Rimot.io Incorporated. All rights reserved.
 *
 * This software is licensed under the Berkley Software Distribution (BSD)
 * 3-Clause license. Redistribution and use in source and binary forms,
 * with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of mosquitto nor the names of its
 *    contributors may be used to endorse or promote products derived from
 *    this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#if defined(USE_HAL_DRIVER)
#include "stm32f4xx_hal_pcd.h"
extern PCD_HandleTypeDef hpcd_USB_OTG_FS; /* See usbd_conf.c */
#endif                                    /* USE_HAL_DRIVER */

#if !defined(USE_HAL_DRIVER)

#include <stdint.h>
#include <stdlib.h>
#include <string.h> /* memset */
#include <stdio.h>  /* printf formatting */

#include "cmsis_compiler.h" /* __unaligned_read32 and __unaligned_write32 */

#include "rimot_rcc.h"
#include "rimot_gpio.h"
#include "rimot_usb.h"

#include "ATTRIBUTE_PORTABILITY_HEADER.h"
#include "cmsis_compiler.h"
#include "rimot_LL_debug.h"
#include "rimot_bus_region_offsets.h"
#include "rimot_interrupts.h"
#include "rimot_pin_aliases.h"
#include "rimot_usb_register_masks.h"

/* PHY DEFINTIONS */
#define USB_VBUS_PIN     MCUPIN_PA9
#define USB_DATA_POS_PIN MCUPIN_PA12
#define USB_DATA_NEG_PIN MCUPIN_PA11

#define USB_OTG_FS_TOTAL_FIFO_SIZE      1280U /* Size in Bytes */
#define USB_OTG_FS_HOST_MAX_CHANNEL_NBR 8U    /* include HC0 */
#define USB_OTG_FS_MAX_DEVICE_ENDPTS    4U    /* Including EP0 */
#define USB_OTG_FS_MAX_IN_ENDPOINTS     USB_OTG_FS_MAX_DEVICE_ENDPTS
#define USB_OTG_FS_MAX_OUT_ENDPOINTS    USB_OTG_FS_MAX_DEVICE_ENDPTS
#define USB_OTG_FIFO_SIZE               4000U /* 4 kB */

#define USB_OTG_CORE_ID_300A 0x4F54300AU
#define USB_OTG_CORE_ID_310A 0x4F54310AU

#define USB_OTG_REGISTER_BASE 0x50000000UL

/* Bit positions and masks in bmRequestType */
#define bmRequestType_DIR_POS    (7)
#define bmRequestType_DIR_MSK    (1U << bmRequestType_DIR_POS)
#define bmRequestType_DIR_toDev  (0)
#define bmRequestType_DIR_toHost (1)

#define bmReuqestType_TYPE_POS      (5u)
#define bmReuqestType_TYPE_MSK      (0x3u << (bmReuqestType_TYPE_POS))
#define bmRequestType_TYPE_standard (0u)
#define bmRequestType_TYPE_class    (1u)
#define bmRequestType_TYPE_vendor   (2u)
#define bmRequestType_TYPE_reserved (0u)

#define bmRequestType_TARGET_POS       (0)
#define bmRequestType_TARGET_MSK       (0xFU << (bmReuqestType_TARGET_POS))
#define bmRequestType_TARGET_device    (0)
#define bmRequestType_TARGET_interface (1)
#define bmRequestType_TARGET_endpoint  (2)
#define bmRequestType_TARGET_other     (3)

/* Codes for bRequest in a usb Setup packet */
#define bRequest_GET_STATUS        0
#define bRequest_CLEAR_FEATURE     1
#define bRequest_SET_FEATHER       3
#define bRequest_SET_ADDRESS       5
#define bRequest_GET_DESCRIPTOR    7
#define bRequest_GET_CONFIGURATION 8
#define bRequest_GET_INTERFACE     10
#define bRequest_SET_INTERFACE     11
#define bRequest_SYNC_FRAME        12

/* 64 BYTES MAX FOR FS (USB 2.0 SPEC) */
#define USB_FS_PKT_SZMAX 64

/* Ref man page 1261 section 34.13.1 */
#define USB_OTG_FS_NUM_SETUP_PACKETS 10

/* This is my own value to prevent from hanging in an enum loop forever */
#define USB_OTG_ENUM_POLLTIMEOUT_MAX 20000

/* Device IN endpoints */
typedef __packed struct
{
    volatile uint32_t CTL; /* 0x0900 + (0x0020 * EP_idx)   */

    PAD_WITH_BYTES(0x0900, 0x0908);

    volatile uint32_t INT; /* 0x0908 + (0x0020 * EP_idx)   */

    PAD_WITH_BYTES(0x0908, 0x0910);

    volatile uint32_t TSIZ;   /* 0x0910 + (0x0020 * EP_idx)   */
    volatile uint32_t DMA;    /* 0x0914 + (0x0020 * EP_idx)   */
    volatile uint32_t TXFSTS; /* 0x0918 + (0x0020 * EP_idx)   */

    PAD_WITH_BYTES(0x0918, 0x0920);

} usbEPtRegs;

/**
 * @brief REGISTER MEMORY MAP FOR USB OTG PERIPHERAL
 *
 * @todo
 * LOOK IN CMSIS_COMPILER.H
 * AND USE THE ACTUAL PORTABLE
 * KEYWORD FOR PACKING
 */
typedef __packed struct /* ## WARNING ## MUST BE PACKED TO BE PORTABLE */
{
    /* USB CORE REGS */
    volatile uint32_t GOTGCTL;            /* 0x0000  */
    volatile uint32_t GOTGINT;            /* 0x0004  */
    volatile uint32_t GAHBCFG;            /* 0x0008  */
    volatile uint32_t GUSBCFG;            /* 0x000C  */
    volatile uint32_t GRSTCTL;            /* 0x0010  */
    volatile uint32_t GINTSTS;            /* 0x0014  */
    volatile uint32_t GINTMSK;            /* 0x0018  */
    volatile uint32_t GRXSTSR;            /* 0x001C  */
    volatile uint32_t GRXSTSP;            /* 0x0020  */
    volatile uint32_t GRXFSIZ;            /* 0x0024  */
    volatile uint32_t DIEPTXF0_HNPTXFSIZ; /* 0x0028  */
    volatile uint32_t HNPTXSTS;           /* 0x002c  */

    PAD_WITH_BYTES(0x002c, 0x0038);

    volatile uint32_t GCCFG; /* 0x0038  */
    volatile uint32_t CID;   /* 0x003C  */

    PAD_WITH_BYTES(0x0100, 0x003C);

    volatile uint32_t HPTXFSIZ;    /* 0x0100  */
    volatile uint32_t DIEPTXF[15]; /* 0x0104  */

    PAD_WITH_BYTES(0x013C, 0x0400);

    /* USB HOST CFG REGS */
    volatile uint32_t HCFG;  /* 0x0400  */
    volatile uint32_t HFIR;  /* 0x0404  */
    volatile uint32_t HFNUM; /* 0x0408  */

