jarodfougere/stm32f4_dockerbuild/Sources/Device/Drivers/Rimot Drivers/stm32f411xe/Peripherals/Src/rimot_usb.c
    PAD_WITH_BYTES(0x0410, 0x0408);

    volatile uint32_t HPTXSTS;  /* 0x0410  */
    volatile uint32_t HAINT;    /* 0x0414  */
    volatile uint32_t HAINTMSK; /* 0x0418  */

    PAD_WITH_BYTES(0x0440, 0x0418);

    volatile uint32_t HPRT; /* 0x0440  */

    PAD_WITH_BYTES(0x0500, 0x0440);

    /* HOST CHANNELS */
    struct
    {
        volatile uint32_t CHAR;   /* 0x0500 + (0x0020 * ch_idx)   */
        volatile uint32_t SPLIT;  /* 0x0504 + (0X0020 * ch_idx)   */
        volatile uint32_t INT;    /* 0x0508 + (0x0020 * ch_idx)   */
        volatile uint32_t INTMSK; /* 0x050c + (0x0020 * ch_idx)   */
        volatile uint32_t TSIZ;   /* 0x0510 + (0x0020 * ch_idx)   */
        volatile uint32_t DMA;    /* 0x0514 + (0x0020 * ch_idx)   */

        PAD_WITH_BYTES(0x0520, 0x0514);

    } HC[USB_OTG_FS_HOST_MAX_CHANNEL_NBR];

    PAD_WITH_BYTES(0x05fc, 0x0800);

    /* DEVICE CONFIG REGISTERS */
    volatile uint32_t DCFG; /* 0x0800  */
    volatile uint32_t DCTL; /* 0x0804  */
    volatile uint32_t DSTS; /* 0x0808  */

    PAD_WITH_BYTES(0X0808, 0x0810);

    volatile uint32_t DIEPMSK;  /* 0x0810  */
    volatile uint32_t DOEPMSK;  /* 0x0814  */
    volatile uint32_t DAINT;    /* 0x0818  */
    volatile uint32_t DAINTMSK; /* 0x081c  */

    PAD_WITH_BYTES(0x081c, 0x0828);

    volatile uint32_t DVBUSDIS;   /* 0x0828  */
    volatile uint32_t DVBUSPULSE; /* 0x082c  */
    volatile uint32_t DTHRCTL;    /* 0x0830  */
    volatile uint32_t DIEPEMPMSK; /* 0x0834  */
    volatile uint32_t DEACHINT;   /* 0x0838  */
    volatile uint32_t DEACHMSK;   /* 0x083C  */

    PAD_WITH_BYTES(0x083c, 0x844);

    volatile uint32_t DINEP1MSK; /* 0x0844  */

    PAD_WITH_BYTES(0x0884, 0x844);

    volatile uint32_t DOUTEP1MSK; /* 0x0884  */

    PAD_WITH_BYTES(0x0884, 0x0900);

    /* Device IN endpoints */
    usbEPtRegs DIEP[USB_OTG_FS_MAX_IN_ENDPOINTS];

    PAD_WITH_BYTES(0x097c, 0x0b00);

    /* Device OUT endpoints */
    usbEPtRegs DOEP[USB_OTG_FS_MAX_OUT_ENDPOINTS];

    PAD_WITH_BYTES(0X0B7c, 0x0E00);

    volatile uint32_t PCGCTL; /* 0x0e00 */

    PAD_WITH_BYTES(0x0e00, 0x1000);

    struct
    {
        /* Push/Pop to this region */
        volatile uint8_t buf[USB_OTG_FIFO_SIZE];
    } DFIFO[8];

    PAD_WITH_BYTES(0X8cfc, 0x20000);

    struct
    {
        /* Fifo for diagnostic info */
        volatile uint8_t buf[128000]; /* 128 kB */
    } DRW_FIFO;

} USB_t;

typedef union
{
    __packed struct
    {
        /*
         * in bmRequest type:
         * bit[]
         * bit 7 : data direction (0 == to device, 1 == to host),
         * bit[6:5]
         *
         */
        uint8_t  bmRequestType;
        uint8_t  bRequest;
        uint16_t wValue;
        uint16_t wIndex;
        uint16_t wLength;
    } fields;
    uint8_t bytes[8];

} usbSetupPacket;

typedef struct
{
    usbEPtRegs *regs;      /* Ptr to the register structure for the ep        */
    uint8_t     parity;    /* 1 for odd, 0 for even                           */
    uint32_t    maxpacket; /* Endpoint Max Packet size (kB)                   */
    uint8_t     type;      /* type : eg CONTROL, ISOC, BULK, ETC..            */
    uint8_t     pidStart;  /* data PID start (can be 0 or 1)                  */
    struct
    {
        uint8_t *buf;     /* ptr to application xfer buffer                   */
        uint32_t xferLen; /* xfer len in BYTES                                */
        uint32_t xferCnt; /* xfer counts (case wherin multi pkt received)     */
        uint8_t  num;     /* FIFO index in the peripheral                     */
    } fifo;
} usbEndpointHandle;

struct usbProtocolDriverStruct
{
    USB_t *regs;
    usbClassDriverPtr class;
    uint8_t setupPackets[USB_OTG_FS_NUM_SETUP_PACKETS];

    enum
    {
        CORE_INITIALIZATION,
        WAITING_FOR_BUS_IDLE,
        STARTUP_FROM_SOFT_RESET,
        DEVICE_INITIALIZATION,
        WAITING_FOR_USBRST,
        WAITING_FOR_ENUMDNE,
        ENUMERATION_SERVICED,
        ENUMERATION_COMPLETE,
    } enumState;

    usbEndpointHandle IN_ENDPTS[USB_OTG_FS_MAX_IN_ENDPOINTS];
    usbEndpointHandle OUT_ENDPTS[USB_OTG_FS_MAX_IN_ENDPOINTS];
    void (*delay)(uint32_t);
};

static uint32_t usbDeviceEnumerate(usbProtocolDriver *driver);

/*
 * READ REF MANUAL SECTION 34.17.1 FOR
 * REQUIRED ENUMERATION SEQUENCE
 * REV18 :: PAGE 1335
 */

/* We need a persistence pointer because exception frame has no
knowledge of lower callstack and USB interrupt occurs */
static usbProtocolDriver *driverPtr;

static uint8_t TEST_IN_EP_BUF0[250];
static uint8_t TEST_IN_EP_BUF1[250];
static uint8_t TEST_IN_EP_BUF2[250];
static uint8_t TEST_IN_EP_BUF3[250];

static uint8_t TEST_OUT_EP_BUF0[250];
static uint8_t TEST_OUT_EP_BUF1[250];
static uint8_t TEST_OUT_EP_BUF2[250];
static uint8_t TEST_OUT_EP_BUF3[250];

void usbDriver_setDelayFunc(void (*delayFunc)(uint32_t))
{
    if (NULL != delayFunc)
    {
        if (driverPtr != NULL)
        {
            driverPtr->delay = delayFunc;
        }
    }
}

/* Driver instance constructor */
usbProtocolDriver *usbProtocolDriverInit(usbClassDriverPtr class)
{
    usbProtocolDriver *driver;
    driver = (usbProtocolDriver *)malloc(sizeof(usbProtocolDriver));
    LL_ASSERT(driver != NULL);

    driver->regs = ((USB_t *)(USB_OTG_REGISTER_BASE));
    driverPtr    = driver; /* Link initializer to static module ptr */

    driver->class = class; /* Link class handle */
    memset(driver->setupPackets, 0, sizeof(driver->setupPackets));
    driver->enumState = WAITING_FOR_BUS_IDLE;

    unsigned i;
    for (i = 0; i < USB_OTG_FS_MAX_DEVICE_ENDPTS; i++)
    {
        driver->IN_ENDPTS[i].regs  = &driver->regs->DIEP[i];
        driver->OUT_ENDPTS[i].regs = &driver->regs->DOEP[i];
    }

    driver->IN_ENDPTS[0].fifo.buf = TEST_IN_EP_BUF0;
    driver->IN_ENDPTS[1].fifo.buf = TEST_IN_EP_BUF1;
    driver->IN_ENDPTS[2].fifo.buf = TEST_IN_EP_BUF2;
    driver->IN_ENDPTS[3].fifo.buf = TEST_IN_EP_BUF3;

    driver->OUT_ENDPTS[0].fifo.buf = TEST_OUT_EP_BUF0;
    driver->OUT_ENDPTS[1].fifo.buf = TEST_OUT_EP_BUF1;
    driver->OUT_ENDPTS[2].fifo.buf = TEST_OUT_EP_BUF2;
    driver->OUT_ENDPTS[3].fifo.buf = TEST_OUT_EP_BUF3;

    return driver;
}

