jarodfougere/stm32f4_dockerbuild/Sources/Device/Drivers/Rimot Drivers/stm32f411xe/Peripherals/Src/rimot_usb.c
uint32_t usbDeviceInit(usbProtocolDriver *driver)
{
    /* CONFIGURE THE PHY */

    gpio_enablePinClock(USB_VBUS_PIN);
    gpio_setPinMode(USB_VBUS_PIN, GPIO_MODE_input);
    gpio_setPinPull(USB_VBUS_PIN, GPIO_PIN_PULL_MODE_none);
    gpio_setPinAlternateFunc(USB_VBUS_PIN, GPIO_ALT_FUNC_10);

    /* Configure D- pin */
    gpio_enablePinClock(USB_DATA_NEG_PIN);
    gpio_setPinMode(USB_DATA_NEG_PIN, GPIO_MODE_alternate);
    gpio_setPinPull(USB_DATA_NEG_PIN, GPIO_PIN_PULL_MODE_none);
    gpio_setPinSupplyMode(USB_DATA_NEG_PIN, GPIO_PIN_SUPPLY_MODE_push_pull);
    gpio_setPinSpeed(USB_DATA_NEG_PIN, GPIO_SPEED_max);
    gpio_setPinAlternateFunc(USB_DATA_NEG_PIN, GPIO_ALT_FUNC_10);

    /* Configure D+ pin */
    gpio_enablePinClock(USB_DATA_POS_PIN);
    gpio_setPinMode(USB_DATA_POS_PIN, GPIO_MODE_alternate);
    gpio_setPinPull(USB_DATA_POS_PIN, GPIO_PIN_PULL_MODE_none);
    gpio_setPinSupplyMode(USB_DATA_POS_PIN, GPIO_PIN_SUPPLY_MODE_push_pull);
    gpio_setPinSpeed(USB_DATA_POS_PIN, GPIO_SPEED_max);
    gpio_setPinAlternateFunc(USB_DATA_POS_PIN, GPIO_ALT_FUNC_10);

    /* Start USB Peripheral clock (assumes prescalers already set) */
    rccEnablePeriphClock(RCC_PERIPH_CLOCK_usb);

    /* Configure interrupt preemption in NVIC and unmask ISR */
    interruptSetPrio(OTG_FS_IRQn, NVIC_PREEMPTION_PRIO_0, NVIC_SUBPRIO_0);
    interruptSetState(OTG_FS_IRQn, INTERRUPT_STATE_enabled);

    uint32_t status = 0;
    LL_ASSERT(NULL != driver);

    /* Acquire a session with the host */
    usbDeviceEnumerate(driver);

    return status;
}

/*
Device initialization
The application must perform the following steps to initialize the core as a
device on powerup or after a mode change from host to device.
1. Program the following fields in the OTG_FS_DCFG register:
– Device speed
– Non-zero-length status OUT handshake
2. Program the OTG_FS_GINTMSK register to unmask the following interrupts:
– USB reset
– Enumeration done
– Early suspend
– USB suspend
– SOF
3. Program the VBUSBSEN bit in the OTG_FS_GCCFG register to enable VBUS
sensing in “B” device mode and supply the 5 volts across the pull-up
resistor on the DP line.
4. Wait for the USBRST interrupt in OTG_FS_GINTSTS. It indicates that a
reset has been detected on the USB that lasts for about 10 ms on receiving
this interrupt. Wait for the ENUMDNE interrupt in OTG_FS_GINTSTS. This
interrupt indicates the end of reset on the USB. On receiving this
interrupt, the application must read the OTG_FS_DSTS register to determine
the enumeration speed and perform the steps listed in Endpoint
initialization on enumeration completion on page 1353. At this point, the
device is ready to accept SOF packets and perform control transfers on
control endpoint 0.
*/

static uint32_t usbDeviceEnumerate(usbProtocolDriver *driver)
{
    uint32_t errCode = 0;
    uint32_t count   = 0;

    /**
     *
     * TURNAROUND VALUE.
     *
     * THIS IS A FUNCTION OF AHB BUS FREQUENCY
     * (IE: FUNCTION OF RCC CONFIGURATION)
     * SEE TABLE 203 IN REF MANUAL PAGE 1276 (REV 18)
     *
     * @todo Implement the table lookup based on RCC config.
     * For now, Since we know we'll be running at 48MHz,
     * we can just set 0x06u as the value.
     */
    const uint32_t trdt_val = 0x0A; /** @todo revise val to table lookup*/
    const uint32_t maxCount = USB_OTG_ENUM_POLLTIMEOUT_MAX;

    /*
     * Make sure we aren't re-enumerating. This could occur when we
     * transition from CDC to DFU in composite device class
     */

    /* State machine */
    for (driver->enumState = STARTUP_FROM_SOFT_RESET;
         driver->enumState != ENUMERATION_COMPLETE;
         count++)
    {
        /* Timeout check */
        if (count > maxCount)
        {
            errCode = 1;
            break;
        }

        switch (driver->enumState)
        {
            case WAITING_FOR_BUS_IDLE:
            {
                /* Wait until bus is idle */
                if (driver->regs->GRSTCTL & (GRSTCTL_AHBIDL))
                {
                    /* Initiate soft reset */
                    driver->regs->GRSTCTL |= (GRSTCTL_CSRST);
                    driver->enumState = STARTUP_FROM_SOFT_RESET;
                }
            }
            break;
            case STARTUP_FROM_SOFT_RESET:
            {
                /* Hardware has cleared CSRST indicating completed soft
                 * reset */
                if (0 == (driver->regs->GRSTCTL & (GRSTCTL_CSRST)))
                {
                    driver->enumState = CORE_INITIALIZATION;
                }
            }
            break;
            case CORE_INITIALIZATION:
            {
                /** @note SEE SECTION 22.17.1 IN RM0383 */

                /* STEP 1 */
                driver->regs->GAHBCFG |= ((GAHBCFG_GINT) | (GAHBCFG_TXFELVL));
                driver->regs->GINTSTS |= (GINTSTS_RXFLVL);

                /* STEP 2 */
                driver->regs->GUSBCFG =
                    ((GUSBCFG_HNPCAP) | (GUSBCFG_SRPCAP) |
                     (trdt_val << GUSBCFG_TRDT_POS) | (5 << GUSBCFG_TOCAL_POS));

                /* STEP 3 */
                driver->regs->GINTMSK |= ((GINTMSK_OTGINT) | (GINTMSK_MMISM));

                /**
                 * STEP 4  : FORCE DEVICE MODE.
                 * (step 4 in RM0383 is actually missing info, see note
                 * below
                 * @note SEC 22.5, BULLET PT 4 IN RM0383, PAGE 674
                 */

                if (!((driver->regs->GINTSTS & (GINTSTS_CMOD)) ==
                      (CMOD_DEVICE)))
                {
                    /*
                     * If the "B" plug event didn't correctly trigger core
                     * devCfg sequence, (likely due to USB_ID line not
                     * physically connected / used on PCB)
                     * then force device mode
                     */
                    driver->regs->GUSBCFG &=
                        ~((GUSBCFG_FDMOD) | (GUSBCFG_FHMOD));
                    driver->regs->GUSBCFG |= (GUSBCFG_FDMOD);

                    while (!((driver->regs->GINTSTS & GINTSTS_CMOD) ==
                             (CMOD_DEVICE)))
                    {
                        /* Wait for HW to complete transition */
                    }
                }

                /* UPDATE STATE MACHINE */
                driver->enumState = DEVICE_INITIALIZATION;
            }
            break;
            case DEVICE_INITIALIZATION:
            {
                uint32_t temp = 0;

                /** @note SEE SECTION 22.17.3 IN RM0383 */
                /* STEP 1 */
                driver->regs->DCFG |= ((DCFG_DSPD_FULLSPEED) | (DCFG_NZLSOHSK));
                /*
                 * note that DCFG::DSPD is to inform host of USB spec speed
                 * support. The bus will not not operate at full speed if
                 * HOST does not ALSO support to device's speed spec
                 */

                temp &= ~GCCFG_NOVBUSSENS;  /* Enable VBUS sensing */
                temp &= ~(GCCFG_VBUSASEN);  /* Disable type "A" VBUS sensing */
                temp |= (GCCFG_VBUSBSEN);   /* Enable type "B" VBUS sensing  */
                temp |= (GCCFG_PWRDWN);     /* Activate tranceiver           */
                driver->regs->GCCFG = temp; /* Load configuration register   */

                /* YOU GOTTA UPDATE THE STATE MACHINE BEFORE UNMASKING */
                driver->enumState = WAITING_FOR_USBRST;

                temp = 0;
                temp |= (GINTMSK_USBRST);   /* unmask host-initiated reset */
                temp |= (GINTMSK_USBSUSPM); /* unmask session suspend */
                temp |= (GINTMSK_ENUMDNEM); /* unmask enumeration complete */
                temp |= (GINTMSK_ESUSPM);   /* unmask early suspend        */
                temp |= (GINTMSK_SOFM);     /* unmask start of frame       */
                temp |= (GINTMSK_RXFLVLM);  /* unmask RX fifo non-empty    */
                driver->regs->GINTMSK |= temp;
            }
            break;
            case WAITING_FOR_USBRST:
            {
                /* DO NOTHING, IRQ WILL SERVICE */
            }
            break;
            case WAITING_FOR_ENUMDNE:
            {
                driver->delay(10); /* Spec requires 10ms window to allow host to
                                   process and acknowledge enumeration */
            }
            break;
            case ENUMERATION_SERVICED:
            {
                /* hang here while we test some stuff */
                LL_ASSERT(0);
            }
            break;
            default:
            {
                LL_ASSERT(0);
            }
            break;
        }
    }
    return errCode;
}

#endif /* !USE_HAL_DRIVER */

static uint32_t serviceEndpointInterrupt(uint32_t epNum, uint32_t isInEp)
{
    uint32_t retVal = 0;
    if (isInEp)
    {
    }
    else
    {
    }
    return retVal;
}

