jarodfougere/stm32f4_dockerbuild/Sources/Device/Drivers/Rimot Drivers/stm32f411xe/Peripherals/Src/rimot_usb.c
void OTG_FS_IRQHandler(void)
{
#if defined(USE_HAL_DRIVER)
    HAL_PCD_IRQHandler(&hpcd_USB_OTG_FS);
#else
    LL_ASSERT(NULL != driverPtr);
    if (((driverPtr->regs->GINTSTS & (GINTSTS_CMOD)) == (CMOD_DEVICE)))
    {
        if (driverPtr->regs->GINTSTS &
            (GINTSTS_MMIS)) /* Mode mismanagement interrupt */
        {
            /*
             * The core sets this bit when the application is trying
             * to access) – A host mode register, when the core is
             * operating in device mode – A device mode register,
             * when the core is operating in host mode The register
             * access is completed on the AHB with an OKAY response,
             * but is ignored by the core internally and does not
             * affect the operation of the core.
             */

            /* Acknowledge interrupt but do nothing */
            driverPtr->regs->GINTSTS &= ~(GINTSTS_MMIS);
        }

        if (driverPtr->regs->GINTSTS &
            (GINTSTS_OTGINT)) /* OTG protocol event */
        {
            /*
             * The core sets this bit to indicate an OTG protocol
             * event. The application must read the OTG Interrupt
             * Status (OTG_FS_GOTGINT) register to determine the
             * exact event that caused this interrupt. The
             * application must clear the appropriate status bit in
             * the OTG_FS_GOTGINT register to clear this bit.
             */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_USBRST))
        {
            /* See sectuib 22.17.5 in RM0383 */

            /* STEP 1 */
            unsigned i;
            for (i = 0; i < USB_OTG_FS_MAX_DEVICE_ENDPTS; i++)
            {
                /* Clear EP ISR flags before stall */
                driverPtr->regs->DIEP[i].INT = 0xFB7FU;
                driverPtr->regs->DOEP[i].INT = 0xFB7FU;

                /* Unstall any stalled endpoints */
                driverPtr->regs->DIEP[i].CTL &= ~(DIEPCTL_STALL);
                driverPtr->regs->DOEP[i].CTL &= ~(DOEPCTL_STALL);

                /* Send endpoint (IN AND OUT) NAK bits */
                driverPtr->regs->DOEP[i].CTL |= (DOEPCTL_SNAK);
                driverPtr->regs->DIEP[i].CTL |= (DIEPCTL_SNAK);
            }

            /* STEP 2 */
            driverPtr->regs->DAINTMSK =
                ((DAINTMSK_OEPM_EP0) | (DAINTMSK_IEPM_EP0));

            driverPtr->regs->DOEPMSK |=
                ((DOEPMSK_STUPM) | (DOEPMSK_XFRCM) | (DOEPMSK_EPDM) |
                 (DOEPMSK_OTEPSPRM) | (DOEPMSK_NAKM));
            driverPtr->regs->DIEPMSK |=
                ((DIEPMSK_TOCM) | (DIEPMSK_XFRCM) | (DIEPMSK_EPDM));

            /* STEP 3 */
            /* SET UP THE DATA FIFO RAM FOR EACH OF THE FIFOS */

            while (!(driverPtr->regs->GRSTCTL & (GRSTCTL_AHBIDL)))
            {
                /* Wait for master bus to finish activity */
            }

            /* Flush transmit fifos */
            driverPtr->regs->GRSTCTL =
                ((GRSTCTL_TXFFLSH) | (GRSTCTL_TXFNUM_ALL));

            /*
             * Absolute minimum fifo depth is sufficient bytes for
             * 1 standard packet
             *          +
             * 1 control packet
             *          +
             * 1 setup packet
             */
            uint32_t tmp = USB_FS_PKT_SZMAX;

            /** @todo FIX MAGIC NUMBERS ONCE CODE IS WORKING */
            tmp += 2; /* 2 words for status of control packet */

            /* room for setup packets */
            /* 10 words. See pg 785, step 2, RM0383 */
            tmp += 10 * sizeof(uint32_t);

            tmp *= 2; /* Factor of 2 for headroom */

            /* set fifo depth register */
            driverPtr->regs->GRXFSIZ = (tmp << (GRXFSIZ_RXFD_POS));

            /* program TXF0 fifo size register */
            driverPtr->regs->DIEPTXF0_HNPTXFSIZ = USB_FS_PKT_SZMAX;

            /*
             * STEP 4 ) program OUT endpoint to receive 3 back to back
             * setup packets
             */

            /** @todo FIX MAGIC NUMBERS */
            driverPtr->regs->DOEP[0].TSIZ = (3 << (DOEPTSIZ_STUPCNT_POS)) |
                                            (1 << DOEPTSIZ_PKTCNT_POS) |
                                            (30 << DOEPTSIZ_XFRSIZ_POS);

            driverPtr->regs->GINTSTS &= (GINTSTS_USBRST);

            if (driverPtr->enumState == WAITING_FOR_USBRST)
            {
                /*
                 * Reset command has been serviced,
                 * now we wait for host to indicate enumeration complete
                 */
                driverPtr->enumState = WAITING_FOR_ENUMDNE;
            }
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_ENUMDNE))
        {
            /* See section 22.17.5 in RM0383 */

#if defined(STM32F411VE)
            /* On eval board turn on orange LED to indicate enum success */
            gpio_enablePinClock(MCUPIN_PD14);
            gpio_setPinMode(MCUPIN_PD14, GPIO_MODE_output);
            gpio_setPinPull(MCUPIN_PD14, GPIO_PIN_PULL_MODE_none);
            gpio_setPinSpeed(MCUPIN_PD14, GPIO_SPEED_max);
            gpio_setPinSupplyMode(MCUPIN_PD14, GPIO_PIN_SUPPLY_MODE_push_pull);
            gpio_setDigitalPinState(MCUPIN_PD14, GPIO_PIN_STATE_high);
#endif /* STM32F411VE */

            /* Get enumerated speed bits from DSTS */
            if ((driverPtr->regs->DSTS & (DSTS_ENUMSPD)) == (DSTS_ENUMSPD_FS))
            {
                driverPtr->regs->DIEP[0].CTL &= ~(DIEPCTL_MPSIZ);
                driverPtr->regs->DIEP[0].CTL |=
                    ((DIEPCTL_MPSIZ_64bytes) << (DIEPCTL_MPSIZ_POS));
            }
            else
            {
                LL_ASSERT(0); /* 48MHZ is only speed valid on this mcu */
            }

            /* Set the MPS of the IN EP0 to 64 bytes */
            driverPtr->regs->DIEP[0].CTL &= ~(DIEPCTL_MPSIZ);
            driverPtr->regs->DIEP[0].CTL |= (DIEPCTL_MPSIZ_64bytes);

            /**
             * [CARL, APRIL 12, 2020]
             * @note RM0383 (REV3), PAGE 738
             * SEEMS TO INDICATE THAT HARDWARE KEEPS DIEPCTL::EPENA
             * ALWAYS SET AT PART OF ENUMERATION SEQUENCE BUT THE
             * FACT THAT IT HAS AHB WRITE ACCESS BY APPLICATION
             * SEEMS TO INDICATE OTHERWISE.
             *
             * ALSO, HW DEBUG FOR cortex m4 (ISA v7) via SWD probe
             * indicates that DIEPCTL::EPENA DOES #### NOT ####
             * GET SET AS PART OF HOST ACKNOWLEDGEMENT DURING
             * USB DEVICE SESSION ENUMERATION SEQUENCE (ISR SERVICE)
             *
             * FOR NOW, I'm manually setting the bit
             */
            driverPtr->regs->DIEP[0].CTL |= (DIEPCTL_EPENA);

