jarodfougere/stm32f4_dockerbuild/Sources/Device/Drivers/Rimot Drivers/stm32f411xe/Peripherals/Src/rimot_usb.c
            /*
             * Prompt clear of global control
             * endpoint IN host-pkt unack bit
             * (hw will clear)
             */
            driverPtr->regs->DCTL |= (DCTL_CGINAK);

            /** @todo Consider hanging (block w/ timeout)
             *  until RXFLVL gets serviced
             */

            /* Update application state machine */
            if (driverPtr->enumState == WAITING_FOR_ENUMDNE)
            {
                driverPtr->enumState = ENUMERATION_SERVICED;
            }

            driverPtr->regs->GINTSTS &= (GINTSTS_ENUMDNE);
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_SOF)) /* Start of frame */
        {
            /*
             * In host mode, the core sets this bit to indicate that
             * an SOF (FS), or Keep-Alive (LS) is transmitted on the
             * USB. The application must write a 1 to this bit to
             * clear the interrupt. In device mode, in the core sets
             * this bit to indicate that an SOF token has been
             * received on the USB. The application can read the
             * Device Status register to get the current frame
             * number. This interrupt is seen only when the core is
             * operating in FS.
             */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_RXFLVL))
        {
            /* Mask Interrupt until packet moves from FIFO to Application */
            driverPtr->regs->GINTMSK &= ~(GINTMSK_RXFLVLM);

            /* Get current status */
            uint32_t GRXSTSP = driverPtr->regs->GRXSTSR;
            uint32_t BCNT    = (GRXSTSP & (GRXSTSP_BCNT)) >> (GRXSTSP_BCNT_POS);
            uint32_t EPNUM = (GRXSTSP & (GRXSTSP_EPNUM)) >> (GRXSTSP_EPNUM_POS);
            uint32_t PKTSTS = GRXSTSP & (GRXSTSP_PKTSTS);

            volatile uint32_t *pktSrc =
                (volatile uint32_t *)driverPtr->regs->DFIFO[EPNUM].buf;

            uint32_t *pktDst;
            switch (PKTSTS)
            {
                case GRXSTSP_PKTSTS_DEVMODE_OUT_PKT:
                {
                    /* Destination is EP receive buffer */
                    pktDst =
                        (uint32_t *)(driverPtr->OUT_ENDPTS[EPNUM].fifo.buf +
                                     driverPtr->OUT_ENDPTS[EPNUM].fifo.xferCnt);
                }
                break;
                case GRXSTSP_PKTSTS_DEVMODE_STUP_PKT:
                {
                    /* Destination is setup packets */
                    pktDst =
                        (uint32_t *)(driverPtr->setupPackets +
                                     driverPtr->OUT_ENDPTS[EPNUM].fifo.xferCnt);
                }
                break;
                case GRXSTSP_PKTSTS_DEVMODE_STUP_CPLT:
                {
                    pktDst =
                        (uint32_t *)(driverPtr->setupPackets +
                                     driverPtr->OUT_ENDPTS[EPNUM].fifo.xferCnt);

                    /* clear transfer count */
                    driverPtr->OUT_ENDPTS[EPNUM].fifo.xferCnt = 0;
                }
                break;
                case GRXSTSP_PKTSTS_DEVMODE_OUT_CPLT:
                {
                    driverPtr->OUT_ENDPTS[EPNUM].fifo.xferCnt = 0;
                }
                break;
                case GRXSTSP_PKTSTS_DEVMODE_GONAK:
                {
                }
                break;
            }

            /* POP received data from peripheral FIFO stack */
            if (BCNT)
            {
                uint32_t wordCnt = (BCNT + 3) / sizeof(uint32_t);
                if (NULL != driverPtr->OUT_ENDPTS[EPNUM].fifo.buf)
                {
                    uint32_t b;
                    if (NULL != pktDst)
                    {
                        for (b = 0; b < wordCnt; b++)
                        {
                            __UNALIGNED_UINT32_WRITE(pktDst, *pktSrc);
                            pktDst++;
                        }
                    }
                    else
                    {
                        LL_ASSERT(0);
                    }
                }
            }

            /* Update transfer count for endpoint */
            driverPtr->OUT_ENDPTS[EPNUM].fifo.xferCnt += BCNT;

            /* Unmask RXLVL interrupt */
            driverPtr->regs->GINTMSK |= (GINTMSK_RXFLVLM);
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_NPTXFE))
        {
            /* Non-periodic fifo non-empty (device wants to xmit) */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_GINAKEFF))
        {
            /*
             * isochronous IN NAK effective interrupt
             * Indicates that the Set global non-periodic IN NAK bit
             * in the OTG_FS_DCTL register (SGINAK bit in
             * OTG_FS_DCTL), set by the application, has taken
             * effect in the core. That is, the core has sampled the
             * Global IN NAK bit set by the application. This bit
             * can be cleared by clearing the Clear global
             * non-periodic IN NAK bit in the OTG_FS_DCTL register
             * (CGINAK bit in OTG_FS_DCTL). This interrupt does not
             * necessarily mean that a NAK handshake is sent out on
             * the USB.
             *
             * NOTE ) The STALL bit takes precedence over the NAK
             * bit.
             */

            /* Clear GINSTS )) GINAKEFF by clearing DTCL))GGINAK */
            driverPtr->regs->DCTL &= ~(DCTL_CGINAK);
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_GOUTNAKEFF))
        {
            /*
             * OUT NAK effective interrupt.
             * Indicates that the Set global OUT NAK bit in the
             * OTG_FS_DCTL register (SGONAK bit in OTG_FS_DCTL),
             * set by the application, has taken effect in the core.
             * This bit can be cleared by writing the Clear global
             * OUT NAK bit in the OTG_FS_DCTL register (CGONAK bit
             * in OTG_FS_DCTL).
             */

