jarodfougere/stm32f4_dockerbuild/Sources/Device/Drivers/Rimot Drivers/stm32f411xe/Peripherals/Src/rimot_usb.c
            /* Clear GINSTS )) GONAKEFF by setting DTCL))GGONAK */
            driverPtr->regs->DCTL |= (DCTL_CGONAK);
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_ESUSP))
        {
            /* Early suspend (no activity on D+ for ~3ms) */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_USBSUSP))
        {
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_ISOODRP))
        {
            /* dropped isoc OUT packet */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_EOPF))
        {
            /* End of periodic frame */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_IEPINT))
        {
            /* an IN endpt caused an interrupt */
            const uint32_t daint = driverPtr->regs->DAINT;
            uint32_t       epnum = DAINT_IEPINT_EP0;
            uint32_t       epPos;
            /* FIND WHICH ENDPOINT CAUSED THE INTERRUPT */
            for (epPos = 0; epPos < USB_OTG_FS_MAX_DEVICE_ENDPTS; epPos++)
            {
                uint32_t epMsk          = epnum << epPos;
                uint32_t epNeedsService = daint & epMsk;
                if (epNeedsService)
                {
                    serviceEndpointInterrupt(epPos, 1);
                }
            }
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_OEPINT))
        {
            /* an OUT endpt caused an interrupt */
            uint32_t daint = driverPtr->regs->DAINT;
            uint32_t epnum = DAINT_OEPINT_EP0;
            uint32_t epPos;
            /* FIND WHICH ENDPOINT CAUSED THE INTERRUPT */
            for (epPos = 0; epPos < USB_OTG_FS_MAX_DEVICE_ENDPTS; epPos++)
            {
                uint32_t epMsk          = epnum << epPos;
                uint32_t epNeedsService = daint & epMsk;
                if (epNeedsService)
                {
                    serviceEndpointInterrupt(epPos, 0);
                }
            }
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_IISOIXFR))
        {
            /* Incomple isoc xfer IN */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_PXFR_INCOMPISOOUT))
        {
            /*
             * Incomplete isochronous OUT trnasfer interrupt
             *  In device mode, the core sets this interrupt to
             * indicate that there is at least one isochronous OUT
             * endpoint on which the transfer is not completed in
             * the current frame. This interrupt is asserted along
             * with the End of periodic frame interrupt (EOPF) bit
             * in this register
             */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_CIDSCHG))
        {
            /* Connector ID status change */
        }

        if (driverPtr->regs->GINTSTS & (GINTSTS_SRQINT))
        {
            /*
             * Session request/new session detected interrupt
             *
             *  In host mode, this interrupt is asserted when a
             * session request is detected from the device. In
             * device mode, this interrupt is asserted when VBUS is
             *  in the valid range for a B-peripheral
             */
        }

        if (driverPtr->regs->GINTSTS &
            (GINTSTS_WKUINT)) /* Resume/remote wakeup detcted */
        {
            /*
             * In device mode, this interrupt is asserted
             * when a resume is detected on the USB.
             * In host mode, this interrupt is asserted when a
             * remote wakeup is detected on the USB.
             */
        }
    }
    else /* HOST MODE */
    {
    }
#endif /* USE_HAL_DRIVER */
}
